Revit 2027 API
ConnectorDomainType Enumeration
 Type of connector domain.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ConnectorDomainType
Public Enumeration ConnectorDomainType
public enum class ConnectorDomainType
type ConnectorDomainType
Members
Member name | Value | Description
CableTrayConduit | 4 |  Connector of cable trays or conduits
Electrical | 2 |  Electrical connector
Hvac | 1 |  HVAC (duct) connector
Piping | 3 |  Piping connector
StructuralAnalytical | 5 |  Connector of Structural Analytical Model
Undefined | 0 |  Domain is undefined
See Also
Reference
Autodesk.Revit.DB Namespace